In [1]:
# data concatenation is used to combine data when we have data in multiple parts
import pandas as pd

In [13]:
df1=pd.DataFrame({
    "id":[1,2,3,4],
    "name":["roshan","uday","amit", "vedaant"]
})

df2=pd.DataFrame({
    "id":[5,6,7,8],
    "name":["adit","naman","aman", "suman"]
    })
pd.concat([df1,df2])
pd.concat([df1,df2], ignore_index=True)
pd.concat([df1,df2],axis=1,ignore_index=True
         )

   0        1  2      3
0  1   roshan  5   adit
1  2     uday  6  naman
2  3     amit  7   aman
3  4  vedaant  8  suman

In [4]:
df1

   id     name
0   1   roshan
1   2     uday
2   3     amit
3   4  vedaant

In [5]:
df2

{'id': [5, 6, 7, 8], 'name': ['adit', 'naman', 'aman', 'suman']}